---
kind: type
id: T:Autodesk.Revit.DB.ShowHiddenLinesValues
source: html/5d2b053f-3eb4-9642-0339-1c42a6003d89.htm
---
# Autodesk.Revit.DB.ShowHiddenLinesValues

Provides options for display of hidden lines in a given view.

## Syntax (C#)
```csharp
public enum ShowHiddenLinesValues
```